'''Упражнение 1 Напишите программу, которая суммирует числа от 1 до n.
'''
n = int(input('Введите число'))
i = 1
while i <=n:
  print(i, end = ' ')
  i += 1