'''Упражнение 22 Написать программу, которая выводит словарь в цикле.
'''
d = {i: i ** i for i in range(10)}
print(d)