'''Упражнение 19
Написать программу, которая выводит сумму ключей словаря.'''
d = {1: 'n', 2: 'i', 3: 'k', 4: 'i', 5: 't', 6: 'a'}
print(sum(d))
