'''Упражнение 20
Написать программу, которая выводит уникальные значения словаря.'''
d = {1: 'n', 2: 'i', 3: 'k', 4: 'i', 5: 't', 6: 'a'}
print(set(d.values()))
