'''Упражнение 24
Написать программу которая очищает список.
'''
l = [1, 2, 3, 4, 5]
l.clear()
print(l)
