'''Упражнение 35
Написать   программу,   которая   используя   генерирует   число   из   заданного   промежутка,   но
генерирует число с двумя знаками после запятой.'''
import random
n = random.uniform(1, 100) 
print(round(n, 2))
        
