'''Упражнение 36
Написать   программу,   которая   используя   генерирует   число   из   заданного   промежутка   с
заданным шагом'''
import random
n = random.randrange(1, 100, 5) 
print(n)
        
